export const AllianceAgreement = [
	{
		title: `一、本娱乐城对代理联盟的权利与义务（以下协议本娱乐城简称娱乐城）<br>`,
		content: `娱乐城的客服部会登记联盟的会员并会观察他们的投注状况。联盟及会员必须同意并遵守娱乐城的会员条例，
		政策及操作程式。娱乐城保留拒绝或冻结联盟/会员帐户权利代理联盟可随时登入介面观察旗下会员的下注状况及会员在网站
		的活动概况。 娱乐城的客服部会根据代理联盟旗下的会员计算所得的佣金。<br>
		娱乐城保留可以修改合约书上的任何条例，包括: 现有的佣金范围、佣金计划、付款程式、及参考计划条例的权力，娱乐城会
		以电邮、网站公告等方法通知代理联盟。 代理联盟对于所做的修改有异议，代理联盟可选择终止合约，或洽客服人员反映意见。
		如修改后代理联盟无任何异议，便视作默认合约修改，代理联盟必须遵守更改后的相关规定。`
	},
	{
		title: `二、代理联盟对娱乐城的权力及义务<br>`,
		content: `代理联盟应尽其所能，广泛地宣传、销售及推广娱乐城，使代理本身及娱乐城的利润最大化。代理联盟可在不违反
		法律下，以正面形象宣传、销售及推广娱乐城，并有责任义务告知旗下会员所有娱乐城的相关优惠条件及产品。<br>
		代理联盟选择的娱乐城推广手法若需付费，则代理应承担该费用。任何娱乐城相关资讯包括: 标志、报表、游戏画面、图样、文
		案等，代理联盟不得私自复制、公开、分发有关材料，娱乐城保留法律追诉权。 如代理在做业务推广有相关需要，请随时洽娱乐城。`
	},
	{
		title: `三、规则条款<br>`,
		content: `各阶层代理联盟不可在未经娱乐城许可情况下开设双/多个的代理帐号，也不可从娱乐城帐户或相关人士赚取佣金。请
		谨记任何阶层代理不能用代理帐户下注，娱乐城有权终止并封存帐号及所有在游戏中赚取的佣金。<br>
		为确保所有娱乐城会员帐号隐私与权益，娱乐城不会提供任何会员密码，或会员个人资料。各阶层代理联盟亦不得以任何方式取得会
		员资料，或任意登入下层会员帐号，如发现代理联盟有侵害娱乐城会员隐私行为，娱乐城有权取消代理联盟红利，并取消代理联盟帐号。<br>
		代理联盟旗下的会员不得开设多于一个的帐户。娱乐城有权要求会员提供有效的身份证明以验证会员的身份，并保留以IP判定是否重複
		会员的权利。如违反上述事项，娱乐城有权终止玩家进行游戏并封存帐号及所有于游戏中赚取的佣金。<br>
		代理联盟不可为自己或其他联盟下的有效投注会员,只能是公司直属下的有效投注会员, 代理每月需有5个下线有效投注（有效投注为每
		月至少上线5次进行正常投注），如有违反联盟协议娱乐城有权终止并封存帐号及所有在游戏中赚取的佣金。<br>
		如代理联盟旗下的会员因为违反条例而被禁止享用娱乐城的游戏，或娱乐城退回存款给会员，娱乐城将不会分配相应的佣金给代理联盟。
		如代理联盟旗下会员存款用的信用卡、银行资料须经审核，娱乐城保留相关佣金直至审核完成。<br>
		合约内的条件会以娱乐城通知接受代理联盟加入后开始执行。娱乐城及代理联盟可随时终止此合约，在任何情况下，代理联盟如果想终
		止合约，都必须以书面/电邮方式提早于七日内通知娱乐城。 代理联盟的表现会3个月审核一次，如代理联盟已不是现有的合作成员则
		本合约书可以在任何时间终止。如合作伙伴违反合约条例，娱乐城有权立即终止合约。<br>
		在没有娱乐城许可下，代理联盟不能透露及授权娱乐城相关密资料，包括代理联盟所获得的回馈、佣金报表、计算等;代理联盟有义务
		在合约终止后仍执行机密档及资料的保密。<br>
		在合约终止后，代理联盟及娱乐城将不须要履行双方的权利及义务。终止合约并不会解除代理联盟于终止合约前应履行的义务。`
	}
];
