// 配置文件
const lotteriesRebateOptions = {
		1: "时时彩",
		15: "11选5",
		35: "快3",
		55: "快乐十分",
		68: "一般彩种",
		72: "六合彩",
		81: "幸运赛车",
		82: "快乐8",
		96: "幸运28"
	},
	// 支持撤单的站点
	supportCancelOrderId = ["aay-a", "oop-a"],
	// 多品牌战略，默认为EG
	multiBrandStrategicName = [
		{ siteName: "ooz-a", title: "利发" },
		{ siteName: "zza-a", title: "利发" },
		{ siteName: "zzb-a", title: "利发" },
		{ siteName: "zzc-a", title: "利发" }
	];

// 基础配置
export const BASIC_CONFIGURATION = {
	lotteriesRebateOptions: lotteriesRebateOptions,
	supportCancelOrderId: supportCancelOrderId,
	multiBrandStrategicName: multiBrandStrategicName
};
export const CDN_HOST = "https://static.cloudywoo.com";

// 快三id
export const fastThreeIds = [
	35,
	36,
	37,
	38,
	39,
	40,
	41,
	42,
	43,
	44,
	45,
	46,
	47,
	48,
	49,
	50,
	51,
	52,
	53,
	120
];

// 快三玩法规则
export const fastThreeRule = {
	和值: `猜3个开奖号相加的和，3-10为小，11-18为大。`,
	两连: `任选一长牌组合、当开奖结果任2码与所选组合相同时，即为中奖。
            举例：如开奖号码为1、2、3、则投注两连12、两连23、两连13皆视为中奖。`,
	独胆: `三个开奖号码其中一个与所选号码相同时、即为中奖。
            举例：如开奖号码为1、1、3，则投注独胆1或独胆3皆视为中奖。
            备注：不论当局指定点数出现几次，仅派彩一次(不翻倍)。 `,
	豹子: `豹子：对相同的三个号码(111、222、333、444、555、666)中的
            任意一个或多个进行投注，所选号码开出，即为中奖。
            任意：对所有相同的三个号码(111、222、333、444、555、666)进行投注，
            任意号码开出，即为中奖。`,
	对子: `从11-66中任选1个或多个号码，选号与奖号(包含11-66，
            不限顺序)相同，即为中奖（不含豹子）。`,
	三同号通选: `对所有相同的三个号码(111、222、333、444、555、666)进行投注，任意号码开出，即为中奖。`,
	三同号单选: `对相同的三个号码(111、222、333、444、555、666)中的任意一个或多个进行投注，所选号码开出，即为中奖。`,
	三不同号: `从1-6中任选3个或多个号码,所选号码与开奖号码的3个号码相同,即为中奖。`,
	三连号通选: `对所有的3个相连号码(123、234、345、456)进行投注，任意号码开出，即为中奖。`,
	二同号复选: `从11-66中任选1个或多个号码，选号与奖号(包含11-66，不限顺序)相同，即为中奖（不含豹子）。`,
	二同号单选: `选择1对相同号码和1个不同号码投注，选号与奖号相同，即为中奖。`,
	二不同号: `从1-6中任选2个或多个号码，所选号码与开奖号码任意2个号码相同，即为中奖。`
};
// 彩种图标
export const LOTTERY_ICON_LIST = [
	{
		1: [1, 2, 3, 4, 5, 6, 7, 8, 10, 11, 12, 13, 14, 107, 108, 109, 112, 113, 115, 116]
	}, //时时彩
	{ 3: [75, 76, 77, 78, 81] }, // pk拾
	{ 4: [35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 120] }, // 快乐3
	{ 5: [67, 68] }, // 3D
	{ 6: [55, 56, 57, 58, 59, 60, 61, 62, 63, 119] }, // 快乐十分
	{
		7: [
			15,
			16,
			17,
			18,
			19,
			20,
			21,
			22,
			23,
			24,
			25,
			26,
			27,
			28,
			29,
			30,
			31,
			32,
			33,
			34,
			117,
			118
		]
	}, // 11选5
	{ 8: [95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106] }, // 幸运彩
	{ 9: [9] }, // 时时乐
	{ 64: [64, 114] }, // 番摊
	{ 65: [65] }, // 双色球
	{ 66: [66] }, // 七乐彩
	{ 69: [69] }, // 排列3
	{ 70: [70] }, // 排列5
	{ 71: [71] }, // 七星彩
	{ 72: [72, 73, 74, 75] }, // 六合彩
	{ 79: [79] }, // 极速飞车
	{ 80: [80] }, // 幸运飞艇
	{ 82: [82, 83, 86, 87, 88, 90, 92, 93] }, // 快乐8
	{ 84: [84] }, // 加拿大卑斯
	{ 85: [85] }, // 加拿大西部
	{ 89: [89] }, // 台湾宾果
	{ 91: [91] }, // 澳洲快乐彩
	{ 94: [94] }, // 极速蛋蛋
	{ 121: [121] } // 极速百家乐
];

// 快三玩法配置
export const KS_PLAY_LIST = {
	"664": [111, 222, 333, 444, 555, 666], // 三同号单选
	"665": [1, 2, 3, 4, 5, 6], // 三不同号
	"667": [11, 22, 33, 44, 55, 66], // 二同号复选
	"668": [11, 22, 33, 44, 55, 66, 1, 2, 3, 4, 5, 6], // 二同号单选
	"669": [1, 2, 3, 4, 5, 6] // 二不同号
};

// 所有彩种配置
export const ALL_LOTTERY_MAP = new Map()
	.set("ssc", [1, 2, 3, 4, 5, 6, 7, 8, 10, 11, 12, 13, 14, 108, 109, 112, 113, 115, 116, 121])
	.set("pk10", [76, 77, 78, 79, 80, 81])
	.set("k3", [35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 120])
	.set("fd", [9, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 114])
	.set("k10", [55, 56, 57, 59, 60, 61, 62, 63, 119])
	.set("e11", [
		15,
		16,
		17,
		18,
		19,
		20,
		21,
		22,
		23,
		24,
		24,
		25,
		26,
		27,
		28,
		29,
		30,
		31,
		32,
		33,
		34,
		117,
		118
	])
	.set("klc", [82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93])
	.set("xyc", [94, 95, 96, 97, 99, 100, 101, 102, 103, 104, 105, 106]);
