export const yubaoRule = [
	{
		id: 1,
		title: "如何将余额转入余额宝？",
		content: [
			{
				text: "1)、手机登录应用，点击首页底部导航栏【余额宝】，选择【余额宝】"
			},
			{
				text: "2)、点击【转入】，输入转入金额及安全密码，确认即可"
			}
		]
	},
	{
		id: 2,
		title: "余额宝转入转出额度是否存在限制？",
		content: [
			{
				text:
					"举例：余额宝转入金额最低为【100】元且转入需要满足打码量，当有效打码量大于或等于要求打码量即可进行转入操作。" +
					"转出金额最低为【10】元，且满足转出需要的打码量即可进行转出操作。"
			}
		]
	},
	{
		id: 3,
		title: "余额宝如何获取收益？",
		content: [
			{
				text:
					"余额宝是一种资金管理服务转入余额宝金额，资金由第三方信托托管，" +
					"享受比银行基准利率更高的储蓄收益"
			}
		]
	},
	{
		id: 4,
		title: "余额宝的有效份额如何计算？",
		content: [
			{
				text:
					"1)、会员可能发生多次存取，发放收益时，会根据有效份额进行结算（遵循先进先出的原则）"
			},
			{
				text: "2)、00：00 至 03：00确认前一交易日的市场份额"
			},
			{
				text:
					"3)、A 当前余额    B 24小时内转入金额   【计算公式：有效份额=A-B" +
					"例：2019年9月26日16：00转入金额：1000元，" +
					"2019年9月27日00：00点确认有效份额=1000-1000=0元，27号再次转入2000元，" +
					"28日有效份额=3000-2000=1000元"
			}
		]
	},
	{
		id: 5,
		title: "余额宝的收益如何计算？",
		content: [
			{
				text: `<span class="red_color">余额宝 每天的收益都不同， 计算公式如下：【昨日收益=已确认金额*日化率 】</span><br/>
				<br/>
				例：昨日已确认的金额为10W，日化率为4‱，则昨日收益为：10W*4‱=40元
				`
			},
			{
				text: `
				<br/>
				<span class="wenxin">温馨提示：</span><br/>
				1、余额宝是复利的，每日收益会计入已确认金额 ，用来计算次日收益；<br/>
				2、已确认金额在周末和节假日同样能享受收益；<br/>
				3、每天03:00-05:00结算发放前一天的收益
				`
			}
		]
	},
	{
		id: 6,
		title: "手机上如何隐藏余额宝金额？",
		content: [
			{
				text: "1.手机登录应用，点击首页底部导航栏【余额宝】，选择【余额宝】"
			},
			{
				text: "2.点击【总金额】旁边的【小眼睛】图标即可实现隐藏/显示"
			}
		]
	},
	{
		id: 7,
		title: "余额宝与银行利息有什么不同？",
		content: [
			{
				text:
					"银行存款利率是在基准利率的基础上，" +
					"银行根据储户存款金额及存款年限给出的浮动存款利率；" +
					"它是有存款金额及存款年限要求的；而余额宝对以上两项没有实际要求，" +
					"随存随取，存款利率高于银行基准利率；"
			}
		]
	},
	{
		id: 8,
		title: "余额宝收益的发放时间？",
		content: [
			{
				text: `转入余额的资金如果还未获得收益，不要着急，余额宝并不是当日转入当天计入收益的。<br/>
				<br/>
				<span class="red_color">余额宝升级也同样需要 重新确认份额后，才会发放收益，确认并发放时间同下方余额宝转入时间</span><br/>
				<br/>
				转入余额宝的资金会在第二个交易日由基金公司进行份额确认，对已确认的份额，会在次日03:00-05:00结算发放<br/>
				收益未更新前，页面会显示“<span class="red_color">客官别急</span>”，请您不用担心，耐心等待更新即可<br/>
				`
			},
			{
				text: `
				<br/>
				<span class="wenxin">温馨提示：</span><br/>
				1、当天收益发放可能会稍有延迟，请05：00后再关注一下<br/>
				2、已确认金额在周末和节假日同样能享受收益
				`
			}
		]
	}
];
